package bot

const rssURL = "http://feeds.rucast.net/radio-t"

const site = "https://radio-t.com/"

const mainInformationText = "Радио-Т - это еженедельный HiTech подкаст на русском языке.\n\nЧто вы хотите узнать?"
const mainInformationTTS = "Радио-Т - это еженедельный Х+айТ+эк падкаст на русском языке. - - - - - - - - - - Что вы хотите узнать?"

const lastReleaseText = "Последний выпуск – %s. Вышел %s\nТемы:\n%s"
const lastReleaseTTS = "Последний выпуск – %s. Вышел %s. - - - - - - - - - - Ещё что-нибудь?"

const nextReleaseText = "Следующий выпуск будет через %d %s %d %s"
const nextReleaseTTS = "Следующий выпуск будет через %d %s %d %s. - - - - - - - - - - Ещё что-нибудь?"

const nextGeekReleaseText = "Следующий гиковский выпуск будет через %d %s %d %s"
const nextGeekReleaseTTS = "Следующий гиковский выпуск будет через %d %s %d %s. - - - - - - - - - - Ещё что-нибудь?"

const endConverseationText = "Пока! Если что, вы всегда можете вызвать меня снова"
const endConverseationTTS = "Пока! Если что, вы всегда можете вызвать меня снова"

const wrongCommandText = "Неверная команда. Для того, чтобы узнать, что бот умеет скажите \"Помощь\""
const wrongCommandTTS = "Неверная команда. Для того, чтобы узнать, что бот умеет скажите - Помощь. Или, может быть, подойдёт что-то из этого?"

const playReleaseText = "К сожалению, я пока этого не умею. Может, что-нибудь другое?"
const playReleaseTTS = "К сожалению, я пока этого не умею. Может, что-нибудь другое?"

const botInfoText = `Это бот для еженедельного HiTech подкаста Радио-Т. Он позволяет узнать:
* когда будет следующий выпуск;
* информацию о последнем выпуске.

Доступные команды:
* Сайт подкаста
* Расскажи про последний выпуск
* Когда следующий выпуск
* Когда следующий гиковский выпуск
* Закончить

Что вы хотите узнать?`
const botInfoTTS = "Это бот для еженедельного Х+айТ+эк падкаста Радио-Т. - - - - - - - - - - Что вы хотите узнать?"

const errorText = "Ой, что-то пошло не так."
const errorTTS = "Ой, что-то пошло не так. Может, попробуете что-нибудь другое?"
